{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":784,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,784],"dtype":"float32"}},{"class_name":"Dense","config":{"units":392,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./NumberModel.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[784,784],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[784],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[784,392],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[392],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[392,10],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[10],"dtype":"float32"},{"name":"iter","shape":[],"dtype":"int32","group":"optimizer"},{"name":"dense_Dense1/kernel/m","shape":[784,784],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/bias/m","shape":[784],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/kernel/m","shape":[784,392],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/bias/m","shape":[392],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/kernel/m","shape":[392,10],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/bias/m","shape":[10],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/kernel/v","shape":[784,784],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense1/bias/v","shape":[784],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/kernel/v","shape":[784,392],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense2/bias/v","shape":[392],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/kernel/v","shape":[392,10],"dtype":"float32","group":"optimizer"},{"name":"dense_Dense3/bias/v","shape":[10],"dtype":"float32","group":"optimizer"}]}]}